Sample SOAP Request XMLs/EmployeeRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="www.outoftheboxacademy.com">
    <soapenv:Header/>
    <soapenv:Body>
        <tns:EmployeeRequest>
            <EmployeeID>EMP-1005</EmployeeID>
        </tns:EmployeeRequest>
    </soapenv:Body>
</soapenv:Envelope>
